{"metadata":{"responseInfo":{"status":200,"developerMessage":"OK","userMessage":"","errorCode":"","moreInfo":""},"requestInfo":{"apiVersion":1,"resource":"petitions","query":{"body":null,"createdAfter":null,"createdAt":null,"createdBefore":null,"isPublic":1,"isSignable":null,"limit":10,"mock":0,"offset":0,"petitionsDefaultLimit":1000,"publicThreshold":149,"responseId":null,"signatureCount":null,"signatureCountCeiling":null,"signatureCountFloor":0,"signatureThreshold":null,"signatureThresholdCeiling":null,"signatureThresholdFloor":null,"status":null,"title":null,"url":null,"websiteUrl":"https://petitions.whitehouse.gov"}},"resultset":{"count":3594,"limit":10,"offset":0}},"results":[{"id":"54ed3067ee140ff838000000","type":"petition","title":"stop the Assyrian genocide. We the American people are requesting that immediate action to protect minorities in Syria.","body":"ISIS and different extreme Muslim militias are attacking Christians in Syria, killing them, burning their churches. We are asking the United States government to condemn this act of genocide ad get involved in protecting minorities in Syria. United States should stop supporting the so called freedom fighters who turned out to be an Islamic Militia that killed more Christians in Syria and violated  human rights.\r\nIt is time to speed up political solution in Syria to protect its people from diminishing.","issues":[{"id":"28","name":"Human Rights"}],"signatureThreshold":100000,"signatureCount":1600,"signaturesNeeded":98400,"url":"https://petitions.whitehouse.gov/petition/stop-assyrian-genocide-we-american-people-are-requesting-immediate-action-protect-minorities-syria/BwzNqWnx","deadline":1427420070,"status":"open","response":null,"created":1424831670,"isSignable":true,"isPublic":true},{"id":"54ecf921688938b93a000000","type":"petition","title":"weight the ramifications of S. 213 and urge lawmakers to cease consideration of said bill.","body":"We oppose the passing of S.213 on the grounds that - if passed, it would fail to protect us as a Law, as:\r\n\r\n1) There has been no official study on xLook-Alike Weaponsx since 1990:\r\n\r\nBJS, xToy Guns: Involvement in Crime and Encounters with the Policex, pub. June 1990, U.S. Congress, PL 100-615.\r\n\r\n2) It increases confusion; firearms can be colored in same manner suggested in S.213.\r\n\r\n3) It exempts paintball markers; RAP4 markers are manufactured to replicate AR15 and Shotgun weapons.\r\n\r\nPassing this law dilutes real solutions. Our industries and communities implore you to see past situations as aberrant. Help us find real solutions.\r\n\r\nWe thank you for your time and consideration.\r\n\r\nSincerely and respectfully,\r\n\r\nThe responsible enthusiasts, communities, and business leaders of Airsoft.","issues":[{"id":"22","name":"Firearms"},{"id":"151","name":"Small Business"},{"id":"163","name":"Trade"}],"signatureThreshold":100000,"signatureCount":1039,"signaturesNeeded":98961,"url":"https://petitions.whitehouse.gov/petition/weight-ramifications-s-213-and-urge-lawmakers-cease-consideration-said-bill/PqtYd3vQ","deadline":1427408410,"status":"open","response":null,"created":1424820010,"isSignable":true,"isPublic":true},{"id":"54eb47e900e5799672000000","type":"petition","title":"invite General James Mad Dog Mattis over for a 2 year sleep over.","body":"General Mattis is a great man and War hero.  Loved by the men whom served under him and known for his intellect.  He is a candid speaker and has a great deal of wisdom to offer those around him.  Inviting General Mattis over for a sleep over would be of great benefit to all.  As the Presidents daughters are entering dating age, all potential suiters could be vetted by General Mattis before being allowed to take them on a date.  Only a fool would cross General Mattis. Moreover, needing nothing more than a cot and poncho liner, General Mattis would take up very little space.  In addition, this move would score points with the fiscal conservatives as you could lay off half the secret service staff guarding the White House.  It is a Win/Win if I ever saw one. ","issues":[{"id":"26","name":"Homeland Security and Disaster Relief"},{"id":"30","name":"Innovation"},{"id":"181","name":"Veterans and Military Families"}],"signatureThreshold":100000,"signatureCount":190,"signaturesNeeded":99810,"url":"https://petitions.whitehouse.gov/petition/invite-general-james-mad-dog-mattis-over-2-year-sleep-over/XcVHKck2","deadline":1427294411,"status":"open","response":null,"created":1424706011,"isSignable":true,"isPublic":true},{"id":"54e9b982704301732d000001","type":"petition","title":"Allow @Chippy_Nonstop's ban to uplifted and visa be reinstated.","body":"@Chippy_Nonstop's visa was nonapplicable at the entry of the US and has been deported from the United States of America, we ask that the 5 year ban be lifted and her to be allowed a visa to the US.","issues":[{"id":"4","name":"Civil Rights and Liberties"}],"signatureThreshold":100000,"signatureCount":910,"signaturesNeeded":99090,"url":"https://petitions.whitehouse.gov/petition/allow-chippynonstops-ban-uplifted-and-visa-be-reinstated/N1BkXXmq","deadline":1427192055,"status":"open","response":null,"created":1424603655,"isSignable":true,"isPublic":true},{"id":"54e9b1ca00e579ed69000001","type":"petition","title":"Pardon non-violent drug offenders. Free them all.","body":"As Bill Maher said:\r\n\"Obama should acknowledge that putting people in jail for non-violent drug offenses was a giant mistake in the first place, and then he should use the power of the Presidential pardon and free them all. C'mon, you know you want to.  You've been stingy with those pardons.  Here's a great way to make up for it and there's plenty of precedent.  Lincoln, a Republican, pardoned the Southern rebels after the Civil  war.  Ford, a Republican, pardoned Viet Nam draft  dodgers. Ronald Reagan signed an amnesty for 2.7 million Mexican illegals.  If Republicans can forgive people for armed insurrection, desertion, and speaking Spanish, a Democrat can forgive us for getting high.\"\r\n\r\nPrison, instead of treatment, for non-violent drug offenders is expensive, inhumane, and wrong.","issues":[{"id":"4","name":"Civil Rights and Liberties"},{"id":"10","name":"Criminal Justice and Law Enforcement"},{"id":"28","name":"Human Rights"}],"signatureThreshold":100000,"signatureCount":452,"signaturesNeeded":99548,"url":"https://petitions.whitehouse.gov/petition/pardon-non-violent-drug-offenders-free-them-all/JGhSfJnN","deadline":1427191130,"status":"open","response":null,"created":1424602730,"isSignable":true,"isPublic":true},{"id":"54e993e2adfd956632000000","type":"petition","title":"Create a postage stamp supporting breastfeeding.The image of a mother nursing her baby sends a positive global message.","body":" I am  introducing this petitionon on behalf of women and their families. As a US citizen, I would like to see breastfeeding represented via the US Postal Service. This can be done by producing a postage stamp that includes an image of a mother breastfeeding her baby. Seeing an image of breastfeeding depicted on a stamp, that is affixed to mail in the US helps to send the message to individuals that breastfeeding is normal. \r\n I've seen topics that need support addressed through a postage stamp. Breastfeeding should be one of those topics. Supporting breastfeeding has positive outcomes.  This is a way our country can help do this. Country's such as Afghanistan,Uganda and Algeria are just a few that already done this.The US is ready to show its support for the normalization of breastfeeding.","issues":[{"id":"21","name":"Family"},{"id":"25","name":"Health Care"},{"id":"115","name":"Postal Service"}],"signatureThreshold":100000,"signatureCount":888,"signaturesNeeded":99112,"url":"https://petitions.whitehouse.gov/petition/create-postage-stamp-supporting-breastfeedingthe-image-mother-nursing-her-baby-sends-positive-global-message/sLDVHyTx","deadline":1427184356,"status":"open","response":null,"created":1424595956,"isSignable":true,"isPublic":true},{"id":"54e92420adfd952034000000","type":"petition","title":"Recognize law enforcement dispatchers at emergency personnel","body":"Law enforcement dispatchers may not work on the front line, but we are the TRUE first responders. All dispatchers work through traumatic situations every day. We should be allowed the same benefits as all emergency personnel. Dispatchers are frequently over looked and forgotten. We give CPR instructions over the phone, counsel adults and children, and help the public remain calm in stressful situations. That's just a sample of what is done on a daily basis. A police department would not be able to properly function without the men and women that walk in every day, put on that headset, and make sure every firefighter, medic, and officer goes home. ","issues":[{"id":"10","name":"Criminal Justice and Law Enforcement"},{"id":"28","name":"Human Rights"},{"id":"103","name":"Labor"}],"signatureThreshold":100000,"signatureCount":312,"signaturesNeeded":99688,"url":"https://petitions.whitehouse.gov/petition/recognize-law-enforcement-dispatchers-emergency-personnel/fX21T6z6","deadline":1427154312,"status":"open","response":null,"created":1424565912,"isSignable":true,"isPublic":true},{"id":"54e913eeadfd95897d000003","type":"petition","title":"Josh's Law..Please make bullying a Federal/Criminal Offense if someone dies as a result of bullying.","body":"Josh Copeland was a bright young man in his Senior year. He was being bullied and felt suicide was his only option.  I want to see that bullies are not allowed to do this to our children.  They should be held responsible for the action of the victim. If they are underage, the Parents of the bully should be held responsible for their child's actions.  A Law..Josh's Law..needs to STOP bullies.  If there are severe consequences..we can deter bullying and SAVE our precious children.","issues":[{"id":"10","name":"Criminal Justice and Law Enforcement"},{"id":"18","name":"Education"},{"id":"127","name":"Regulatory Reform"}],"signatureThreshold":100000,"signatureCount":441,"signaturesNeeded":99559,"url":"https://petitions.whitehouse.gov/petition/joshs-lawplease-make-bullying-federalcriminal-offense-if-someone-dies-result-bullying/4pxHd9k5","deadline":1427150674,"status":"open","response":null,"created":1424562274,"isSignable":true,"isPublic":true},{"id":"54e7d557ee140f4d4d000003","type":"petition","title":"Declare the MBTA a federal disaster area","body":"The Boston metropolitan area and the MBTA in particular is suffering from relentless snowfall and frigid temperatures causing a system-wide meltdown and needs assistance to recover from the winter of 2014-2015. Declaring the MBTA as a federal disaster area would open funding and resources to fix this neglected transit system and push the New England economy and Boston area's transportation infrastructure into the 21st century","issues":[{"id":"193","name":"Government Reform"},{"id":"169","name":"Transportation and Infrastructure"},{"id":"175","name":"Urban Policy"}],"signatureThreshold":100000,"signatureCount":198,"signaturesNeeded":99802,"url":"https://petitions.whitehouse.gov/petition/declare-mbta-federal-disaster-area/dRZKg5Cq","deadline":1427068237,"status":"open","response":null,"created":1424479837,"isSignable":true,"isPublic":true},{"id":"54e7cbf47043012624000000","type":"petition","title":"Give grandparents rights in the state of Florida and other states. Grandparent alienation is child abuse!","body":"End Grandparent Alienation! Its child abuse and should be punishable!\r\n\r\n\r\nThis is our story\r\n\r\nJenmarie, our granddaughter came to live with us at 3 days old. Mom left her at 10 days old. we got temporary court custody at a month old. Mom saw child probably 5 x in her life. @ 5 yrs old,  Jan 13th, 2015 mom file to revoke custody and child was removed and moved to Another state the same day. I was treated like a criminal in court. How is that the best interest of a child?  We are now a broken family and have not seen or spoken to our loving granddaughter  for a month. She grew up thinking she was our daughter, with a 3 yr old sister and family members suffering as well. We are now another victim of  grandparent alienation. Please hear our prayers for a change. ","issues":[{"id":"21","name":"Family"}],"signatureThreshold":100000,"signatureCount":349,"signaturesNeeded":99651,"url":"https://petitions.whitehouse.gov/petition/give-grandparents-rights-state-florida-and-other-states-grandparent-alienation-child-abuse/t08BCMKC","deadline":1427066112,"status":"open","response":null,"created":1424477712,"isSignable":true,"isPublic":true}]}